examples/2DCase/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver         	GAMG;
        preconditioner	DIC;
        tolerance       1e-6;
        relTol          1e-3;
        smoother        GaussSeidel;
     
    }

    pFinal
    {
        $p;
        tolerance       1e-8;
        relTol          0;
    }

    U
    {
        solver          PBiCG;
        preconditioner        DILU;
        tolerance       1e-08;
        relTol          1e-3;
    }

  UFinal
    {
        $U;
        tolerance       1e-08;
        relTol          0;
    }

}

PISO
{
    correctPhi          yes;
    nOuterCorrectors    2;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    pRefCell 0; 
    pRefValue 0; 
}

relaxationFactors
{
    fields
    {
    	p   0.3;
    }
    equations
    {
        U       0.7;    
    }
}

// ************************************************************************* //
